package com.example.numerologia.calculate;

import androidx.annotation.NonNull;

public enum DescriptionEnum {
    // число судьбы
    DESCRIPTION_OF_NUMBER_OF_FATE_1 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа судьбы 1: Будучи по своей натуре новатором, " +
                    "вы в постоянном поиске новых идей и методов их реализации. " +
                    "Вы готовы поддержать в трудную минуту любого, " +
                    "из-за чего часто ограничиваете самого себя. " +
                    "Умеете мотивировать, вдохновлять и нести ответственность. " +
                    "Ваше упорство, решительность и уверенность в себе позволяют вам занимать " +
                    "место лидера в обществе.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_2 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа судьбы 2: Вы общительны, терпеливы и прекрасно находите " +
                    "общий язык абсолютно со всеми категориями людей. Владеете способностью " +
                    "видеть человека насквозь благодаря сильно развитой интуиции. " +
                    "Обладая прекрасными навыками общения, вы легко найдете себя в сфере работы " +
                    "с людьми. Ваш высокий уровень коммуникабельности может сделать из вас " +
                    "отличного дипломата.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_3 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 3: Вы – предприимчивая, активная и полная жизни личность." +
                    " Способны выполнять большой объем работы. Ваши энергичность и подвижность" +
                    " способны вдохновлять окружающих и мотивировать их на продуктивную деятельность." +
                    " Всю вашу энергию и динамичность можно с легкостью направить в творческое русло." +
                    " К примеру, вы с легкостью можете реализовать себя в профессии музыканта," +
                    " телеведущего или актера.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_4 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 4: Нацеленность на результат и организаторские " +
                    "способности помогают вам воплощать мечты в жизнь. Вы прекрасно владеете " +
                    "ораторским искусством. Способны представлять и отстаивать интересы коллектива " +
                    "или предприятия. Вполне могли бы найти себя в управленческой деятельности.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_5 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 5: Вы с рождения весьма талантливый человек. " +
                    "Именно ваши способности поспособствуют поиску походящей вам ниши для " +
                    "самовыражения. Чтобы сполна раскрыть все свои таланты, вы не должны " +
                    "ограничиваться в свободе действий. Вы склонны к общению и путешествиям";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_6 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 6: Вы - ответственная, справедливая и добросовестная " +
                    "личность. Всевозможные обязанности не будут давать вам покоя на протяжении " +
                    "всей жизни. Отзывчивы, с любовью и пониманием относитесь к просьбам о помощи. " +
                    "Преследуете цель защищать общественные интересы, относясь к своим с меньшим " +
                    "предпочтением. В постоянной заботе об окружающих ваши потенциальные таланты " +
                    "могут так и остаться нераскрытыми.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_7 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 7: Рассудительный, находчивый, любознательный человек. " +
                    "Вас привлекают многие сферы деятельности, требующие высоких интеллектуальных " +
                    "способностей. Обладаете гибкостью мышления, твердостью духа, умением " +
                    "устранять неясности. Вы – человек, постоянно стремящийся постигнуть новые " +
                    "знания и найти ответы на неразрешимые ранее загадки. Ваши выдающиеся " +
                    "способности найдут блестящее применение в деятельности ученого или преподавателя.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_8 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 8: Вы – сильный духом и уверенный в себе человек. " +
                    "В любой сфере деятельности желаете достичь наилучших результатов. " +
                    "Даже в самых сложных ситуациях не позволяете себе опускать руки. " +
                    "Не отступаете от поставленной цели, пока не исчерпаете все возможные " +
                    "варианты. Вам в радость конкуренция, соперничество и жизненные преграды, " +
                    "они делают вас сильнее.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_9 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 9: " +
                    "Вы – мечтатель, личность с идеализированным мировоззрением. " +
                    "Человек стремящийся построить лучшее будущее и стимулирующий на это окружающих." +
                    " Преследуете цель воспитать в обществе гуманность и внести в него гармонию. " +
                    "В жизни играете роль общественного защитника. " +
                    "Считаете своим долгом отстаивать права тех, " +
                    "кто не в состоянии сделать этого сам.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_11 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 11: Вы имеете способность генерировать хорошие идеи, " +
                    "однако, зачастую вы не уверены в своих силах. Обладаете самым энергетически " +
                    "заряженным числом судьбы. Выполняете функцию передачи энергетических " +
                    "вибраций посылаемых свыше. Соблюдая психологический и эмоциональный баланс, " +
                    "вы сможете управлять потоком энергии посылаемой свыше.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_FATE_22 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа судьбы 22: Вы – целеустремленная, ответственная личность " +
                    "обладающая большими возможностями для реализации своего потенциала. " +
                    "Ориентированы на решение комплексных и сложных задач. Вы не теряете времени " +
                    "на достижение малостоящих целей. Для вас важно оставить свой след в истории " +
                    "человечества. С вашим числом судьбы 22 вероятность достижения " +
                    "таких целей – максимальна.";
        }
    },

    // число души
    DESCRIPTION_OF_NUMBER_OF_SOUL_1 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа души 1: единица – число импульсивного, направленного на " +
                    "достижение высоких целей, человека. Индивидуализм и эгоистичность движут " +
                    "вами и дают некий импульс к действиям. Поставив перед собой цель, люди чьё " +
                    "число души один не смеют менять курс и рвутся вперед. На дух не переносите " +
                    "ограничений, отчего со всеми проблемами разбираетесь с самого их появления. " +
                    "Вы бесстрашный лидер, настойчивый и решительный.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_2 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа души 2: символ человека спокойного в поведении и действиях, " +
                    "мягкого, тактичного, с умение м находить компромиссы, способного держать " +
                    "себя в руках. Вы – человек с противоборством двух равносильных начал " +
                    "действующих в противоположные друг от друга стороны. За счет этих " +
                    "противоборств внутри вас сохраняется равновесие и спокойствие. " +
                    "Вы легко подчиняемы, пассивны и мягки. Вам ближе роль советчика или " +
                    "проектировщика, нежели чем исполнителя.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_3 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 3: символ человека-Универсума. В вас воедино сложены " +
                    "мужская воля и женская любовь . «Тройка» означает полную противоположность " +
                    "двух частей вашего внутреннего я. Число 3 символизирует треугольник жизни " +
                    "между прошлым, настоящим и будущим – Рождение, Жизнь и Смерть. Что касается " +
                    "самих людей, чьё число души 3, они легкомысленны, несерьезны, как правило, " +
                    "живут один днем, не обращая внимания на повседневную суету. Эти люди не " +
                    "способны единолично справиться с самим собой, раскрыть собственные " +
                    "способности. Главной жизненной целью является возвышение в мире, " +
                    "осуществление контроля и власти над другими, хотя и сами превосходно " +
                    "справляются с приказами.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_4 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 4: это число, символизирующее четыре стихии, четыре " +
                    "времени года и четыре периода жизни. Люди с числом души 4 трудолюбивы, " +
                    "уравновешены и рассудительны. Всё чего они хотят добиться добиваются сами. " +
                    "В обсуждениях занимают противоположную позицию и очень редко дают волю " +
                    "эмоциям. «В штыки» воспринимают правила и инструкции, их тянет к реформам. " +
                    "«Четверка» означает успех в технических областях.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_5 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 5: символ человека, не сидящего на одном месте, " +
                    "стремящегося к самосовершенствованию, поиску и приобретению опыта. " +
                    "Вы – натура, переполненная энтузиазма, нуждающаяся в приключениях и риске. " +
                    "Решение действовать приходить спонтанно и внезапно. В жизни вами правят " +
                    "позитивный настрой, находчивость, остроумие и жизнерадостность. " +
                    "Вы направленны только вперед и думаете только о положительном исходе всего, " +
                    "за чтобы не взялись. Как правило люди с числом жизни 5 нервны, " +
                    "авантюрны и очень подвижны.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_6 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 6: число творческой личности, символ семьи и " +
                    "воссоединения мужчины и женщины для создания новой жизни. Число шесть так " +
                    "же символизирует связь между Богом и Человеком. Люди с числом жизни 6 " +
                    "надежны, честны и способны добиться уважения и улучшения не только " +
                    "собственных условий жизни, но и окружающих. Терпеливы и обладают природным " +
                    "внутренним магнетизмом, однако в осуществлении своих планов жестки и " +
                    "настойчивы. Очень романтичны и любят искусство, не выносят ревность и " +
                    "всяческие раздоры. Легко находят общий язык абсолютно со всеми. " +
                    "Обладают большой способностью заводить друзей и повышенное чувство долга. " +
                    "Вы – домосед, счастливы в кругу родных и близких.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_7 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 7: относиться к числу Священных чисел, является символом " +
                    "тайны и знаний. Издавна считалось, что число 7 подразумевать под собой " +
                    "основу всей эволюции. Именно семи духам было поручена Богом власть над " +
                    "стихиями, из которых впоследствии были сотворены все животные и растения. " +
                    "Это число обозначает семь дней недели, семь цветов радуги, семь нот в " +
                    "гамме и т.д. Человек кому принадлежит число души 7 творческая личность хоть " +
                    "и с некоторыми странностями. Хорошо развитая интуиция, способность " +
                    "анализировать, богатая фантазия и яркое воображение – характерные черты " +
                    "таких людей. Как правило, из таких людей выходят художники, " +
                    "поэты или другие деятели искусства.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_8 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 8: это число материального успеха, число надежных людей " +
                    "способных доводить все до совершенства. С одной стороны - это число " +
                    "тотального переворота или революции, а с другой – религиозную приверженность, " +
                    "философские мышления и неотвратимую перспективу, охватывающую все действия. " +
                    "Люди с число души 8 отличны от большинства других людей. Они скрывают свои " +
                    "чувства, из-за чего о них зачастую судят, кому как вздумается. В душе они " +
                    "одиноки и редко находят понимание среди людей, а после смерти их часто " +
                    "превозносят. Ваше число души в профессиональной сфере означает успех в " +
                    "бизнесе, неустрашимость во всех сферах жизни, в частности в коммерции и " +
                    "индустрии. У вас талан управлять коллективом и выдающиеся " +
                    "административные способности.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_SOUL_9 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа души 9: универсальное число, обладает характерными чертами " +
                    "всех простых чисел. Символ успешности и совершенства. Число души 9 является " +
                    "посвящением человека во все этапы его жизни, а также раскрывает все таинства " +
                    "жизни, смерти и перерождения. Символизирует Вас как высокоинтеллектуальную " +
                    "личность, обладающую большой физической силой во всех её формах, способную " +
                    "к развитию и раскрытию громадного потенциала. Ваша успешность заложена в " +
                    "творческих и артистических данных. Вы обладатель чудесных магнетических " +
                    "способностей. Главной проблемой таких людей является не знание, того, по " +
                    "какому пути им следует двигаться, зачастую они не осознают своих способностей. " +
                    "Люди очень импульсивные и вспыльчивые из-за чего возникает наибольшая " +
                    "угроза опасности для них.";
        }
    },

    // число личности
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_1 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа личности 1: Умение себя подать и «обставиться» так, чтобы " +
                    "право отдавать команды ни у кого не вызывало сомнений. Уверенность, " +
                    "деловитость, самостоятельность, способность и воспринимать новое, " +
                    "и создавать его. Броская одежда подчеркивает индивидуальность стиля.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_2 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа личности 2: Тактичность и деликатность. Умение произвести " +
                    "хорошее впечатление на конкретного человека, не привлекая к себе всеобщего " +
                    "внимания. Исключительная контактность, основанная на детальном анализе " +
                    "поведения собеседника. Стиль – классика.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_3 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 3: Природный магнетизм, вызывающий безотчетное " +
                    "расположение и доверие. Умение общаться на волне неизменного дружелюбия " +
                    "позволяет легко заводить друзей и поклонников. " +
                    "Стиль – то, что надето в данный момент.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_4 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 4: Сдержанность и взвешенность во всем, начиная с " +
                    "манеры одеваться и заканчивая стилем общения. Подчеркнутая исполнительность " +
                    "и трудолюбие позволяют произвести на окружающих впечатление надежности, " +
                    "вызвать доверие.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_5 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 5: Умение выглядеть моложе реального возраста и " +
                    "выделяться на любом фоне благодаря выраженной сексуальности. Подвижность, " +
                    "активность, контактность. На этом «пестром» фоне умение рассуждать здраво " +
                    "нередко становится неожиданностью для собеседника.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_6 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 6: Воплощенное чувство долга, честность, надежность." +
                    " Умение видеть перспективу и давать продуманные практические советы." +
                    " Способность быстро сходиться с людьми, тактичность, " +
                    "готовность оказать услугу. " +
                    "Со вкусом подобранная одежда создает образ милого, приятного человека.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_7 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 7: Образ холодного, замкнутого и проницательного " +
                    "интроверта чаще вызывает заинтересованность, чем отторжение. " +
                    "Окружающие инстинктивно ощущают присутствие за этим строгим фасадом " +
                    "благородной души и высокого ума. " +
                    "Изысканность внешнего облика и манеры общения довершает образ.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_8 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 8: Умение произвести сильное, подавляющее впечатление " +
                    "с первого раза. Предпочтение – дорогой одежде и аксессуарам, " +
                    "как необходимым признакам высокого статуса. Ум, компетентность, деловитость, " +
                    "уверенность в себе и своих правах.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_PERSONALITY_9 {
        @NonNull
        @Override
        public String toString() {
            return "Описание числа личности 9: Открытость и, как следствие, " +
                    "эмоциональная уязвимость. В то же время – отзывчивость, умение сопереживать, " +
                    "способность оказать моральную поддержку. Неистребимая вера в добро, " +
                    "склонность к идеализации окружающего мира. Внешний облик часто является " +
                    "отражением мелодраматического настроя.";
        }
    },

    // число жизненного пути
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_1 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 1: Вы – активны, предприимчивы и очень энергичны. " +
                    "Спонтанное влечение творить и неординарный подход к делу делают из вас " +
                    "человека-первооткрывателя. Ваши способности безграничны. Возможности " +
                    "обращаться в будущее и видения перспективы обязательно приведут вас к успеху. " +
                    "Вам подошли бы виды деятельности, требующие явных качеств лидера, " +
                    "коими вы обладаете сполна.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_2 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 2: Вы очень разносторонний человек. " +
                    "Многие виды деятельности окажутся для вас приемлемыми. Вы с легкостью могли " +
                    "бы найти себя как и в творческой деятельности, так и технической, например, " +
                    "легко бы справились с ремонтом замысловатых механизмов часов. Ваше умение " +
                    "настроиться на одну волну абсолютно с любым человеком могло бы " +
                    "поспособствовать хорошей перспективе карьеры юриста или политика.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_3 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 3: У вас предостаточно творческих талантов " +
                    "чтобы посветить себя искусству. Сполна раскрыть и развить свой артистический " +
                    "дар вы сможете, проявив снисхождение и упорство. Чтобы не упустить " +
                    "возможности развивать свои способности сконцентрируйтесь на одном, на том, " +
                    "что больше желает достичь";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_4 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 4: Трудолюбие и усердие в работе ещё на ранних " +
                    "этапах вашей жизни позволят вам занять достойную нишу в обществе. " +
                    "Ваша чрезмерная пунктуальность и методичность, порой, могут заставить людей " +
                    "думать о вас как о человеке с жестким характером. Зачастую эти качества не " +
                    "позволяют достичь нужных результатов вашей деятельности. Вы способны " +
                    "добиться успеха в организаторской деятельности, менеджменте, строительстве " +
                    "и во многом другом если измените свой характер и будете относиться " +
                    "к окружающим лояльней.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_5 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 5: Вы - непревзойденный оратор, умеете " +
                    "расположить к себе абсолютно любого собеседника и мотивировать его на " +
                    "какие-либо действия. Вам характерны гибкость в контакте с людьми, " +
                    "открытость и доброжелательность. Работа в сфере обслуживания, шоу-бизнеса, " +
                    "торговли, туризма, финансов или медицины идеально вам подходит.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_6 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 6: Вы видите свое предназначение в помощи " +
                    "другим людям. Четко чувствуете ту ситуацию, где от вас могла бы потребоваться " +
                    "помощь, ни в коем случае не вмешиваясь в чужие дела без повода. " +
                    "Ваша способность находить новые возможности достижения успеха смогла бы " +
                    "помочь вам достичь хороших результатов в бизнесе. Вы правдивый и " +
                    "заслуживающий доверия человек, это поспособствует продуктивному ведению дел.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_7 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 7: Человек с числом жизненного пути «семь» " +
                    "наделен качествами, которые позволяют ему исполнять роль исследователя. " +
                    "Вы способны выявлять и правильно формулировать проблемы, проанализировать " +
                    "их и найти методы решения. В сфере науки, инноваций, религии, страхования " +
                    "или изобретательства вы найдете себе занятие по душе.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_8 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 8: Вы – обладатель активной жизненной позиции, " +
                    "готовы взять инициативу в свои руки, умеете мотивировать самого себя и " +
                    "окружающих. Всё, за что бы ни взялся человек, которому принадлежит число " +
                    "жизненного пути 8, ему подвластно. Вы смог ли бы справиться абсолютно с " +
                    "любым видом деятельности. Качества уверенного в себе лидера особенно помогут " +
                    "совладать с ведением крупного бизнеса. Жизнь то и дело будет испытывать вас " +
                    "на стойкость, от чего вы будите становиться только сильнее и сможете " +
                    "осуществить самые грандиозные цели.";
        }
    },
    DESCRIPTION_OF_NUMBER_OF_LIFE_PARTH_9 {
        @NonNull
        @Override
        public String toString() {

            return "Описание числа жизненного пути 9: Вы обладаете умением творчески мыслить, " +
                    "представляя окружающий мир оригинальным образом. Воплотить свои идеи в " +
                    "реальность вы сможете, будучи дизайнером или архитектором. Люди, чей " +
                    "жизненный путь связан с цифрой 9, являются социально-активными личностями, " +
                    "Вы справедливы, честны, непредвзяты и способны представлять общие интересы. " +
                    "У вас есть все шансы стать отличным политиком, юристом, " +
                    "преподавателем или врачом.";
        }
    };


}
